Revit 2026 API

# AlignmentStationLabelOptions Class

---

Represents an object containing options for creating an AlignmentStationLabel.

SystemObject Autodesk.Revit.DB.InfrastructureAlignmentStationLabelOptions

**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AlignmentStationLabelOptions
```
```vb
Public Class AlignmentStationLabelOptions
```
```cpp
public ref class AlignmentStationLabelOptions
```
```fsharp
type AlignmentStationLabelOptions = class end
```

The AlignmentStationLabelOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AlignmentStationLabelOptions | Creates an object with default values. |

|  | Name | Description |
| --- | --- | --- |
|  | HasLeader | Specifies if the label will have a leader. The default value is true. |
|  | LeaderEnd | Specifies the leader end point, in model coordinates. The default value is null. When null, the end point will be the same as the Origin point, driven by the Station value. |
|  | LeaderShoulder | Specifies the leader shoulder point, in model coordinates. The default value is null. When null, the shoulder point will be the same as the Origin point, driven by the Station value. |
|  | Station | Specifies the station at which the label will be placed, in Revit internal model units (standard Imperial feet). The station determines the location of the label's origin: Origin by setting it to the closest point on the alignment geometry which corresponds to this station. |
|  | TypeId | Specifies the ElementId of the label type. The default value is InvalidElementId. In this case, the default type id for alignment station labels in the document is used. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Infrastructure Namespace